In [1]:
import numpy as np 
import pandas as pd

# Pandas Basics

In [2]:
dict1 = {
    "name": ['Harsh', 'Rahul', 'Vineet', 'Shanaya', 'Raj', 'Sahil', 'Joy', 'Sandeep'],
    "marks": [87, 95, 15, 67, 96, 98, 50, 88],
    "city": ['Delhi', 'Kolkata', 'Lucknow', 'Bangalore', 'Goa', 'Bhilwara', 'Rampur', 'Varanasi']
}

In [3]:
# DataFrame is a two-dimensional, tabular data structure with labeled axes (rows and columns) 
# and is similar to a spreadsheet or SQL table. The pandas library is widely used for 
# data manipulation and analysis, and the DataFrame is one of its key components.

df = pd.DataFrame(dict1)

In [4]:
# displaying content in tabular form
df

      name  marks       city
0    Harsh     87      Delhi
1    Rahul     95    Kolkata
2   Vineet     15    Lucknow
3  Shanaya     67  Bangalore
4      Raj     96        Goa
5    Sahil     98   Bhilwara
6      Joy     50     Rampur
7  Sandeep     88   Varanasi

In [5]:
# importing to csv
df.to_csv('students.csv')

In [6]:
# importing to csv (with no index)
df.to_csv('students_noindex.csv', index=False)

In [7]:
# head() method displays top 5 rows from top
df.head()

      name  marks       city
0    Harsh     87      Delhi
1    Rahul     95    Kolkata
2   Vineet     15    Lucknow
3  Shanaya     67  Bangalore
4      Raj     96        Goa

In [8]:
# we can also specify how many rows we want from top
df.head(2)

    name  marks     city
0  Harsh     87    Delhi
1  Rahul     95  Kolkata

In [9]:
# tail() method is used to display 5 rows from bottom
df.tail()

      name  marks       city
3  Shanaya     67  Bangalore
4      Raj     96        Goa
5    Sahil     98   Bhilwara
6      Joy     50     Rampur
7  Sandeep     88   Varanasi

In [10]:
# SAME PROPERTY AS OF head()
df.tail(3)

      name  marks      city
5    Sahil     98  Bhilwara
6      Joy     50    Rampur
7  Sandeep     88  Varanasi

In [11]:
# describe() method displays some statistical values of columns containing numbers
df.describe()

           marks
count   8.000000
mean   74.500000
std    29.203718
min    15.000000
25%    62.750000
50%    87.500000
75%    95.250000
max    98.000000

In [12]:
ngo = pd.read_csv('data/data.csv')

In [13]:
ngo

,FULL NAME,Email Id,Age,Gender,Address,Phone No,Program/Project,Volunteer Role,Donation Amount,Membership Status
0,Aarav Sharma,aarav.sharma45@gmail.com,24 years old,Male,"123, Gomti Nagar, Lucknow, Uttar Pradesh - 226010",9.183690e+11,Education Support Program,Teacher,"INR 5,732.00",Member
1,Rhea Patel,rhea.patel29@yahoo.com,29 years old,Female,"45, Mahaveer Road, Varanasi, Uttar Pradesh - 2...",9.195470e+11,Health Clinic Outreach,Project Manager,"INR 3,421.00",Member
2,Zoya Kumar,zoya.kumar88@gmail.com,22 years old,Female,"78, Aminabad Road, Lucknow, Uttar Pradesh - 22...",9.182950e+11,Food Distribution Initiative,Mentor,"INR 17,589.00",Member
3,Veer Singh,veer.singh76@yahoo.com,26 years old,Male,"32, Station Road, Kanpur, Uttar Pradesh - 208001",9.189540e+11,Clean Water Project,Health Educator,"INR 1,243.00",Member
4,Anaya Joshi,anaya.joshi52@gmail.com,25 years old,Female,"17, Civil Lines, Agra, Uttar Pradesh - 282002",9.181240e+11,Youth Empowerment Program,Event Coordinator,"INR 56,890.00",Member
...,...,...,...,...,...,...,...,...,...,...
95,Anvay Patel,anvay.patel33@yahoo.com,22 years old,Male,"34, Ashok Vihar, Kanpur, Uttar Pradesh - 208007",9.183970e+11,Advocacy for Child Protection,Adoption Advocate,"INR 11,234.00",Member
96,Aarini Verma,aarini.verma89@gmail.com,27 years old,Female,"53, Civil Lines, Gorakhpur, Uttar Pradesh - 27...",9.196720e+11,Refugee Integration Support,Eco-Friendly Product Tester,"INR 1,000.00",Member
97,Kiyan Chauhan,kiyan.chauhan43@yahoo.com,25 years old,Male,"25, Sardar Patel Marg, Varanasi, Uttar Pradesh...",9.189270e+11,Cultural Preservation Project,Financial Advisor,"INR 15,678.00",Member
98,Aditya Joshi,aditya.joshi15@gmail.com,30 years old,Male,"46, Jawaharlal Road, Lucknow, Uttar Pradesh - ...",9.184930e+11,Sustainable Fisheries Development,Environmental Advocate,"INR 3,000.00",Member
99,Navya Sharma,navya.sharma72@yahoo.com,28 years old,Female,"32, Rajendra Nagar, Kanpur, Uttar Pradesh - 20...",9.193650e+11,Immunization Campaigns,Humanitarian Photographer,"INR 7,890.00",Member

In [14]:
# get a specific column
ngo['FULL NAME']

0      Aarav Sharma
1        Rhea Patel
2        Zoya Kumar
3        Veer Singh
4       Anaya Joshi
          ...
95      Anvay Patel
96     Aarini Verma
97    Kiyan Chauhan
98     Aditya Joshi
99     Navya Sharma
Name: FULL NAME, Length: 100, dtype: object

In [15]:
ngo.describe()

           Phone No
count  1.000000e+02
mean   9.189810e+11
std    5.424913e+08
min    9.181240e+11
25%    9.184320e+11
50%    9.189420e+11
75%    9.194510e+11
max    9.198720e+11

In [16]:
ngo['FULL NAME'][0] = "Harsh Vardhan"

C:\Users\HARSH\AppData\Local\Temp\ipykernel_14048\3742381718.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ngo['FULL NAME'][0] = "Harsh Vardhan"

#### ‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è
#### The warning is raised because when you do something like ngo['FULL NAME'][0] = "Harsh Vardhan", it involves two operations: accessing a subset of the DataFrame (ngo['FULL NAME']), and then modifying a value within that subset ([0] = "Harsh Vardhan").

#### Pandas is warning you that this operation might not be doing what you expect. If ngo['FULL NAME'] is a view or a copy of another DataFrame, modifying it might not modify the original DataFrame.
#### ‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è‚ö†Ô∏è

In [17]:
ngo.to_csv('ngo_output.csv')

In [18]:
df

      name  marks       city
0    Harsh     87      Delhi
1    Rahul     95    Kolkata
2   Vineet     15    Lucknow
3  Shanaya     67  Bangalore
4      Raj     96        Goa
5    Sahil     98   Bhilwara
6      Joy     50     Rampur
7  Sandeep     88   Varanasi

In [19]:
# let's change index names of df
df.index = ['first', 'second', 'third', 'fourth', 'fifth', 'sixth', 'seventh', 'eighth']

In [20]:
df

            name  marks       city
first      Harsh     87      Delhi
second     Rahul     95    Kolkata
third     Vineet     15    Lucknow
fourth   Shanaya     67  Bangalore
fifth        Raj     96        Goa
sixth      Sahil     98   Bhilwara
seventh      Joy     50     Rampur
eighth   Sandeep     88   Varanasi

### Some Common Terms!!!

![](sad.png)

In [21]:
# it gives a random column of 34 values
ser = pd.Series(np.random.rand(34))

In [22]:
ser

0     0.171303
1     0.463561
2     0.703634
3     0.803467
4     0.771762
5     0.954479
6     0.268706
7     0.826470
8     0.204598
9     0.966602
10    0.203979
11    0.956874
12    0.469601
13    0.173702
14    0.951220
15    0.455551
16    0.404139
17    0.736305
18    0.640172
19    0.846839
20    0.410054
21    0.421117
22    0.669802
23    0.933992
24    0.206001
25    0.081900
26    0.587107
27    0.495462
28    0.139441
29    0.485505
30    0.811615
31    0.956321
32    0.923829
33    0.548776
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
# 334 rows and 5 columnsb
newdf = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))

In [25]:
newdf

            0         1         2         3         4
0    0.771556  0.588614  0.902140  0.849591  0.771212
1    0.447141  0.361976  0.715184  0.452131  0.208883
2    0.035620  0.970457  0.223923  0.300513  0.453816
3    0.164911  0.754886  0.834634  0.272449  0.620027
4    0.562418  0.465644  0.282881  0.937006  0.993652
..        ...       ...       ...       ...       ...
329  0.392649  0.669148  0.459183  0.424997  0.456450
330  0.645468  0.576503  0.044908  0.712336  0.263066
331  0.493697  0.939379  0.626982  0.723298  0.788590
332  0.190003  0.969741  0.640036  0.342506  0.353730
333  0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

##### Usecase of arange() method in numpy üëáüëáüëá

In [26]:
# Create an array of integers from 0 to 9 (10 is exclusive) with a step size of 1
array1 = np.arange(10)
print("Array 1:", array1)

# Create an array of even numbers from 0 to 18 (20 is exclusive) with a step size of 2
array2 = np.arange(0, 20, 2)
print("Array 2:", array2)

# Create an array of values from 0 to 1 (exclusive) with a step size of 0.1
array3 = np.arange(0, 1, 0.1)
print("Array 3:", array3)

Array 1: [0 1 2 3 4 5 6 7 8 9]
Array 2: [ 0  2  4  6  8 10 12 14 16 18]
Array 3: [0.  0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9]

In [27]:
type(newdf)

pandas.core.frame.DataFrame

In [28]:
# The dtypes attribute in pandas is used to display the data types 
# of each column in a DataFrame. When you apply newdf.dtypes, it 
# will return a pandas Series where the index is the column names, 
# and the values are the corresponding data types of each column in the DataFrame.

newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf

            0         1         2         3         4
0    0.771556  0.588614  0.902140  0.849591  0.771212
1    0.447141  0.361976  0.715184  0.452131  0.208883
2    0.035620  0.970457  0.223923  0.300513  0.453816
3    0.164911  0.754886  0.834634  0.272449  0.620027
4    0.562418  0.465644  0.282881  0.937006  0.993652
..        ...       ...       ...       ...       ...
329  0.392649  0.669148  0.459183  0.424997  0.456450
330  0.645468  0.576503  0.044908  0.712336  0.263066
331  0.493697  0.939379  0.626982  0.723298  0.788590
332  0.190003  0.969741  0.640036  0.342506  0.353730
333  0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

In [30]:
newdf[0][0] = "Harsh"

In [31]:
newdf

            0         1         2         3         4
0       Harsh  0.588614  0.902140  0.849591  0.771212
1    0.447141  0.361976  0.715184  0.452131  0.208883
2     0.03562  0.970457  0.223923  0.300513  0.453816
3    0.164911  0.754886  0.834634  0.272449  0.620027
4    0.562418  0.465644  0.282881  0.937006  0.993652
..        ...       ...       ...       ...       ...
329  0.392649  0.669148  0.459183  0.424997  0.456450
330  0.645468  0.576503  0.044908  0.712336  0.263066
331  0.493697  0.939379  0.626982  0.723298  0.788590
332  0.190003  0.969741  0.640036  0.342506  0.353730
333  0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

In [32]:
# Column 0 dtype will change because it contains more than 1 datatypes,
# that is why it is showing object in column 0

newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
newdf.head()

          0         1         2         3         4
0     Harsh  0.588614  0.902140  0.849591  0.771212
1  0.447141  0.361976  0.715184  0.452131  0.208883
2   0.03562  0.970457  0.223923  0.300513  0.453816
3  0.164911  0.754886  0.834634  0.272449  0.620027
4  0.562418  0.465644  0.282881  0.937006  0.993652

In [34]:
# displays index
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [35]:
# here 5 is exclusive
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
# change index of columns
newdf.columns = ['first', 'second', 'third', 'fourth', 'fifth']

In [37]:
newdf

        first    second     third    fourth     fifth
0       Harsh  0.588614  0.902140  0.849591  0.771212
1    0.447141  0.361976  0.715184  0.452131  0.208883
2     0.03562  0.970457  0.223923  0.300513  0.453816
3    0.164911  0.754886  0.834634  0.272449  0.620027
4    0.562418  0.465644  0.282881  0.937006  0.993652
..        ...       ...       ...       ...       ...
329  0.392649  0.669148  0.459183  0.424997  0.456450
330  0.645468  0.576503  0.044908  0.712336  0.263066
331  0.493697  0.939379  0.626982  0.723298  0.788590
332  0.190003  0.969741  0.640036  0.342506  0.353730
333  0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

In [38]:
# convert into numpy array
newdf.to_numpy()

array([['Harsh', 0.5886141891761703, 0.9021400914627272,
        0.8495909306949037, 0.7712121270715858],
       [0.4471405645197629, 0.361976215062644, 0.7151838238072395,
        0.45213134381396725, 0.2088834245940503],
       [0.03561999201039112, 0.9704571685588604, 0.22392298165420876,
        0.30051270380350414, 0.4538158094960051],
       ...,
       [0.4936970179034009, 0.9393788868465495, 0.6269822280464309,
        0.7232982767997139, 0.788589813480611],
       [0.1900033120753324, 0.969741120788247, 0.6400362120909129,
        0.34250573178150134, 0.35372951041551437],
       [0.7988251558078499, 0.22624815550911082, 0.5341465971153321,
        0.25575514981848035, 0.099023736997369]], dtype=object)

In [39]:
ngo.to_numpy()

array([['Harsh Vardhan', 'aarav.sharma45@gmail.com', '24 years old',
        'Male', '123, Gomti Nagar, Lucknow, Uttar Pradesh - 226010',
        918369000000.0, 'Education Support Program', 'Teacher',
        'INR 5,732.00', 'Member'],
       ['Rhea Patel', 'rhea.patel29@yahoo.com', '29 years old', 'Female',
        '45, Mahaveer Road, Varanasi, Uttar Pradesh - 221002',
        919547000000.0, 'Health Clinic Outreach', 'Project Manager',
        'INR 3,421.00', 'Member'],
       ['Zoya Kumar', 'zoya.kumar88@gmail.com', '22 years old', 'Female',
        '78, Aminabad Road, Lucknow, Uttar Pradesh - 226018',
        918295000000.0, 'Food Distribution Initiative', 'Mentor',
        'INR 17,589.00', 'Member'],
       ['Veer Singh', 'veer.singh76@yahoo.com', '26 years old', 'Male',
        '32, Station Road, Kanpur, Uttar Pradesh - 208001',
        918954000000.0, 'Clean Water Project', 'Health Educator',
        'INR 1,243.00', 'Member'],
       ['Anaya Joshi', 'anaya.joshi52@gmail.com', '25 years old',
        'Female', '17, Civil Lines, Agra, Uttar Pradesh - 282002',
        918124000000.0, 'Youth Empowerment Program', 'Event Coordinator',
        'INR 56,890.00', 'Member'],
       ['Reyaan Chauhan', 'reyaan.chauhan11@yahoo.com', '27 years old',
        'Male', '56, Ashok Nagar, Allahabad, Uttar Pradesh - 211003',
        919372000000.0, "Women's Empowerment Initiative", 'Fundraiser',
        'INR 2,356.00', 'Member'],
       ['Myra Kapoor', 'myra.kapoor64@gmail.com', '28 years old',
        'Female', '90, Nishatganj, Lucknow, Uttar Pradesh - 226007',
        918493000000.0, 'Environmental Conservation Project',
        'Web Developer', 'INR 8,765.00', 'Member'],
       ['Ayaan Verma', 'ayaan.verma33@yahoo.com', '30 years old', 'Male',
        '22, Sardar Patel Marg, Gorakhpur, Uttar Pradesh - 273001',
        919128000000.0, 'Skills Training Workshop', 'Graphic Designer',
        'INR 1,234.00', 'Member'],
       ['Kyra Khanna', 'kyra.khanna22@gmail.com', '25 years old',
        'Female', '11, M.G. Road, Meerut, Uttar Pradesh - 250001',
        918692000000.0, 'Orphanage Support Program',
        'Social Media Manager', 'INR 12,478.00', 'Member'],
       ['Ishaan Mehta', 'ishaan.mehta57@yahoo.com', '28 years old',
        'Male', '34, Rajpur Road, Dehradun, Uttar Pradesh - 248001',
        919815000000.0, 'Rural Development Project', 'Content Writer',
        'INR 965.00', 'Member'],
       ['Avani Gupta', 'avani.gupta91@gmail.com', '29 years old',
        'Female', '67, Civil Lines, Moradabad, Uttar Pradesh - 244001',
        918921000000.0, 'Literacy and Numeracy Classes',
        'Research Assistant', 'INR 34,567.00', 'Member'],
       ['Arjun Kumar', 'arjun.kumar18@yahoo.com', '24 years old', 'Male',
        '41, Chowk Bazaar, Bareilly, Uttar Pradesh - 243003',
        918765000000.0, 'Maternal and Child Health Program',
        'Volunteer Coordinator', 'INR 2,342.00', 'Non-Member'],
       ['Kiara Sharma', 'kiara.sharma75@gmail.com', '22 years old',
        'Female', '54, Mall Road, Kanpur, Uttar Pradesh - 208001',
        919543000000.0, 'Microfinance and Entrepreneurship Project',
        'Youth Counselor', 'INR 5,678.00', 'Member'],
       ['Arya Singh', 'arya.singh42@yahoo.com', '26 years old', 'Male',
        '76, Kailashpuri, Varanasi, Uttar Pradesh - 221002',
        918932000000.0, 'Disaster Relief and Recovery Efforts',
        'Translator/Interpreter', 'INR 123.00', 'Member'],
       ['Aryan Malhotra', 'aryan.malhotra68@gmail.com', '27 years old',
        'Male', '29, Ram Bagh, Agra, Uttar Pradesh - 282004',
        919264000000.0, 'Community Sanitation Campaign',
        'Environmental Activist', 'INR 45,678.00', 'Member'],
       ['Saanvi Kapoor', 'saanvi.kapoor29@yahoo.com', '23 years old',
        'Female', '88, Nainital Road, Haldwani, Uttar Pradesh - 263139',
        918419000000.0, 'Empowerment of Persons with Disabilities',
        'Legal Advisor', 'INR 9,876.00', 'Member'],
       ['Arnav Khanna', 'arnav.khanna57@gmail.com', '31 years old',
        'Male', '15, Alambagh, Lucknow, Uttar Pradesh - 226005',
        919657000000.0, 'Agriculture and Farming Training',
        'Marketing Specialist', 'INR 3,210.00', 'Member'],
       ['Aadhya Verma', 'aadhya.verma47@yahoo.com', '30 years old',
        'Female', '61, Civil Lines, Allahabad, Uttar Pradesh - 211001',
        918396000000.0, 'Vocational Training for Youths',
        'Financial Analyst', 'INR 78,543.00', 'Member'],
       ['Kiaan Patel', 'kiaan.patel76@gmail.com', '25 years old', 'Male',
        '39, Mall Avenue, Lucknow, Uttar Pradesh - 226001',
        919872000000.0, 'Refugee Assistance Program',
        'Program Evaluator', 'INR 543.00', 'Member'],
       ['Tara Sharma', 'tara.sharma84@yahoo.com', '29 years old',
        'Female',
        '73, Rajendra Nagar, Gorakhpur, Uttar Pradesh - 273001',
        919123000000.0, 'Elderly Care and Support', 'Nutritionist',
        'INR 23,456.00', 'Non-Member'],
       ['Vivaan Chauhan', 'vivaan.chauhan62@gmail.com', '27 years old',
        'Male', '24, Lajpat Nagar, Kanpur, Uttar Pradesh - 208005',
        918297000000.0, 'HIV/AIDS Awareness and Prevention',
        'Community Organizer', 'INR 1,234.00', 'Member'],
       ['Suhana Joshi', 'suhana.joshi38@yahoo.com', '28 years old',
        'Female', '48, Civil Lines, Meerut, Uttar Pradesh - 250001',
        918954000000.0, 'School Infrastructure Improvement',
        'Data Entry Specialist', 'INR 15,678.00', 'Member'],
       ['Aarohi Mehta', 'aarohi.mehta96@gmail.com', '23 years old',
        'Female', '36, Daryaganj, Agra, Uttar Pradesh - 282002',
        918432000000.0, 'Nutritional Support for Children',
        'Grant Writer', 'INR 345.00', 'Member'],
       ['Dhruv Verma', 'dhruv.verma15@yahoo.com', '26 years old', 'Male',
        '52, Lal Kurti, Dehradun, Uttar Pradesh - 248001',
        919782000000.0, 'Empowerment of Indigenous Communities',
        'Photographer/Videographer', 'INR 7,890.00', 'Member'],
       ['Eshaan Gupta', 'eshaan.gupta23@gmail.com', '24 years old',
        'Female', '19, Ashok Vihar, Moradabad, Uttar Pradesh - 244001',
        919163000000.0, 'Clean Energy Adoption Project',
        'Crisis Intervention Specialist', 'INR 234.00', 'Member'],
       ['Anvi Khanna', 'anvi.khanna53@yahoo.com', '25 years old', 'Male',
        '33, Gandhi Road, Bareilly, Uttar Pradesh - 243001',
        918295000000.0, 'Mental Health and Counseling Services',
        'Public Relations Specialist', 'INR 5,432.00', 'Member'],
       ['Aaryan Kapoor', 'aaryan.kapoor49@gmail.com', '30 years old',
        'Female', '65, Nirala Nagar, Kanpur, Uttar Pradesh - 208014',
        919452000000.0, 'Mobile Health Clinics', 'IT Support',
        'INR 1,000.00', 'Member'],
       ['Siya Kumar', 'siya.kumar17@yahoo.com', '28 years old', 'Male',
        '21, Jawaharlal Road, Varanasi, Uttar Pradesh - 221002',
        918942000000.0, 'Technology Access Program',
        'Occupational Therapist', 'INR 8,765.00', 'Member'],
       ['Vihaan Sharma', 'vihaan.sharma62@gmail.com', '27 years old',
        'Female', '42, Civil Lines, Lucknow, Uttar Pradesh - 226001',
        918672000000.0, "Gender Equality and Women's Rights",
        'Childcare Provider', 'INR 2,134.00', 'Member'],
       ['Kiyaan Joshi', 'kiyaan.joshi73@yahoo.com', '25 years old',
        'Male', '71, Vidhan Sabha Marg, Lucknow, Uttar Pradesh - 226001',
        919126000000.0, 'Street Children Rehabilitation',
        'Human Resources Manager', 'INR 19,876.00', 'Member'],
       ['Kavya Malhotra', 'kavya.malhotra59@gmail.com', '29 years old',
        'Female', '28, Subhash Road, Allahabad, Uttar Pradesh - 211003',
        918392000000.0, 'Disaster Preparedness Workshops',
        'Event Planner', 'INR 3,000.00', 'Member'],
       ['Rudra Chauhan', 'rudra.chauhan84@yahoo.com', '23 years old',
        'Male', '54, Raj Bhavan Road, Lucknow, Uttar Pradesh - 226001',
        919854000000.0, 'Safe Drinking Water Initiative',
        'Music Teacher', 'INR 4,567.00', 'Non-Member'],
       ['Risha Kapoor', 'risha.kapoor98@gmail.com', '30 years old',
        'Female', '18, Connaught Place, Kanpur, Uttar Pradesh - 208001',
        918744000000.0, 'Vocational Training for Women',
        'Speech Therapist', 'INR 23,456.00', 'Member'],
       ['Reeva Verma', 'reeva.verma64@yahoo.com', '26 years old', 'Male',
        '47, Mall Road, Moradabad, Uttar Pradesh - 244001',
        919162000000.0, 'Homeless Shelter and Rehabilitation',
        'Archaeologist', 'INR 1,000.00', 'Member'],
       ['Aanya Khanna', 'aanya.khanna76@gmail.com', '24 years old',
        'Female', '26, M.G. Road, Agra, Uttar Pradesh - 282001',
        918295000000.0, 'Community Garden Project',
        'Eco-Friendly Architect', 'INR 3,456.00', 'Member'],
       ['Vihan Patel', 'vihan.patel15@yahoo.com', '27 years old', 'Male',
        '60, Civil Lines, Varanasi, Uttar Pradesh - 221001',
        919583000000.0, 'Legal Aid and Human Rights Advocacy',
        'Art Therapist', 'INR 789.00', 'Member'],
       ['Ishika Sharma', 'ishika.sharma56@gmail.com', '28 years old',
        'Female',
        '32, Ram Manohar Lohia Road, Lucknow, Uttar Pradesh - 226001',
        918925000000.0, 'Child Sponsorship Program', 'Photographer',
        'INR 2,765.00', 'Member'],
       ['Parth Mehta', 'parth.mehta21@yahoo.com', '25 years old', 'Male',
        '53, Kanpur Road, Lucknow, Uttar Pradesh - 226012',
        918432000000.0, 'Youth Sports and Recreation', 'Sports Coach',
        'INR 9,000.00', 'Member'],
       ['Aryahi Kapoor', 'aryahi.kapoor12@gmail.com', '23 years old',
        'Female', '29, G.T. Road, Allahabad, Uttar Pradesh - 211003',
        919264000000.0, 'Art and Culture Enrichment Program',
        'Historian', 'INR 7,654.00', 'Member'],
       ['Ranbir Khanna', 'ranbir.khanna84@yahoo.com', '31 years old',
        'Male', '64, Nirala Nagar, Lucknow, Uttar Pradesh - 226020',
        918195000000.0, 'Humanitarian Aid for Conflict Zones',
        'Occupational Health and Safety Specialist', 'INR 234.00',
        'Member'],
       ['Naira Joshi', 'naira.joshi45@gmail.com', '29 years old',
        'Female',
        '39, Vidhan Sabha Marg, Kanpur, Uttar Pradesh - 208001',
        919429000000.0, 'Community Library and Learning Center',
        'Horticulturist', 'INR 12,345.00', 'Member'],
       ['Aadi Mehta', 'aadi.mehta47@yahoo.com', '26 years old', 'Male',
        '22, Aminabad Road, Varanasi, Uttar Pradesh - 221002',
        918765000000.0, 'Climate Change Awareness Campaign',
        'Life Coach', 'INR 2,000.00', 'Member'],
       ['Aishani Chauhan', 'aishani.chauhan29@gmail.com', '25 years old',
        'Female', '46, Civil Lines, Lucknow, Uttar Pradesh - 226002',
        919852000000.0, 'Scholarships for Underprivileged Students',
        'Grant Reviewer', 'INR 8,000.00', 'Member'],
       ['Dhairya Verma', 'dhairya.verma61@yahoo.com', '27 years old',
        'Male', '79, Mall Road, Allahabad, Uttar Pradesh - 211001',
        918219000000.0, 'Micro-Enterprise Development', 'Social Worker',
        'INR 9,000.00', 'Member'],
       ['Avisha Gupta', 'avisha.gupta86@gmail.com', '28 years old',
        'Female', '25, Jawaharlal Road, Kanpur, Uttar Pradesh - 208002',
        919487000000.0, 'Nutrition and Food Security',
        'Animal Caretaker', 'INR 345.00', 'Member'],
       ['Atharv Sharma', 'atharv.sharma92@yahoo.com', '24 years old',
        'Male', '57, Rajpur Road, Dehradun, Uttar Pradesh - 248001',
        918397000000.0, 'Social Services for Vulnerable Families',
        'Health Advocate', 'INR 6,543.00', 'Member'],
       ['Naisha Patel', 'naisha.patel63@gmail.com', '22 years old',
        'Female', '31, Nainital Road, Moradabad, Uttar Pradesh - 244001',
        919672000000.0, 'Empowerment of LGBTQ+ Communities',
        'Fitness Instructor', 'INR 1,000.00', 'Member'],
       ['Ishan Kapoor', 'ishan.kapoor26@yahoo.com', '23 years old',
        'Male', '43, Civil Lines, Bareilly, Uttar Pradesh - 243001',
        918927000000.0, 'Early Childhood Education', 'Science Educator',
        'INR 5,678.00', 'Member'],
       ['Aarna Joshi', 'aarna.joshi77@gmail.com', '29 years old',
        'Female', '68, Alambagh, Kanpur, Uttar Pradesh - 208007',
        918493000000.0, 'Mobile Dental Clinics', 'Public Speaker',
        'INR 4,321.00', 'Member'],
       ['Kabir Verma', 'kabir.verma55@yahoo.com', '28 years old', 'Male',
        '16, Kailashpuri, Lucknow, Uttar Pradesh - 226003',
        919365000000.0, 'Water and Sanitation Hygiene (WASH)',
        'Gardener', 'INR 14,567.00', 'Member'],
       ['Ahana Malhotra', 'ahana.malhotra68@gmail.com', '26 years old',
        'Female', '85, Gandhi Road, Varanasi, Uttar Pradesh - 221001',
        918942000000.0, 'Animal Welfare and Conservation',
        'Language Tutor', 'INR 1,000.00', 'Member'],
       ['Reyansh Gupta', 'reyansh.gupta32@yahoo.com', '30 years old',
        'Male', '44, Raj Bhavan Road, Lucknow, Uttar Pradesh - 226003',
        919272000000.0, 'Mobile Health Education Workshops',
        'Tech Support Specialist', 'INR 6,789.00', 'Member'],
       ['Aashna Chauhan', 'aashna.chauhan15@gmail.com', '27 years old',
        'Female',
        '20, Jawaharlal Nehru Road, Kanpur, Uttar Pradesh - 208002',
        919854000000.0, 'Technology for Education',
        'Conflict Resolution Mediator', 'INR 3,200.00', 'Member'],
       ['Aarit Mehta', 'aarit.mehta49@yahoo.com', '25 years old', 'Male',
        '62, Subhash Road, Allahabad, Uttar Pradesh - 211003',
        918197000000.0, 'Youth Mentorship Program', 'Event Photographer',
        'INR 6,543.00', 'Member'],
       ['Pari Sharma', 'pari.sharma73@gmail.com', '29 years old',
        'Female', '35, Civil Lines, Agra, Uttar Pradesh - 282001',
        919451000000.0, 'Mental Health Counseling for Adolescents',
        'Human Rights Advocate', 'INR 7,000.00', 'Member'],
       ['Vihaan Verma', 'vihaan.verma38@yahoo.com', '24 years old',
        'Male', '49, Mahaveer Road, Gorakhpur, Uttar Pradesh - 273001',
        918672000000.0, 'Economic Development in Rural Areas',
        'Personal Trainer', 'INR 2,345.00', 'Member'],
       ['Anaisha Khanna', 'anaisha.khanna64@gmail.com', '22 years old',
        'Female', '37, Lajpat Nagar, Meerut, Uttar Pradesh - 250002',
        919123000000.0, 'Sustainable Agriculture Project',
        'Disaster Relief Coordinator', 'INR 10,987.00', 'Member'],
       ['Armaan Joshi', 'armaan.joshi21.yahoo.com', '28 years old',
        'Male', '75, Ashok Vihar, Kanpur, Uttar Pradesh - 208002',
        918392000000.0, 'Accessible Housing Initiatives',
        'Wilderness Guide', 'INR 1,000.00', 'Member'],
       ['Sanaya Patel', 'sanaya.patel67@gmail.com', '27 years old',
        'Female', '19, Civil Lines, Lucknow, Uttar Pradesh - 226004',
        919746000000.0, 'Community-Based Rehabilitation',
        'Music Therapist', 'INR 4,321.00', 'Member'],
       ['Reyansh Kapoor', 'reyansh.kapoor72@yahoo.com', '26 years old',
        'Male', '68, Alambagh, Allahabad, Uttar Pradesh - 211001',
        918265000000.0, 'Disaster Resilience Education',
        'Nutrition Educator', 'INR 13,456.00', 'Member'],
       ['Meher Khanna', 'meher.khanna84@gmail.com', '30 years old',
        'Female', '40, M.G. Road, Varanasi, Uttar Pradesh - 221002',
        919587000000.0, 'Art Therapy for Trauma Survivors',
        'Art Instructor', 'INR 1,000.00', 'Member'],
       ['Ayansh Chauhan', 'ayansh.chauhan37@yahoo.com', '25 years old',
        'Male', '21, Nishatganj, Lucknow, Uttar Pradesh - 226006',
        918927000000.0, 'Sports for Development', 'Legal Aid Specialist',
        'INR 4,000.00', 'Member'],
       ['Vanya Mehta', 'vanya.mehta93@gmail.com', '24 years old',
        'Female', '50, Civil Lines, Kanpur, Uttar Pradesh - 208005',
        918432000000.0, 'Elderly Socialization and Support',
        'Wilderness First Responder', 'INR 12,345.00', 'Member'],
       ['Arisha Gupta', 'arisha.gupta45@yahoo.com', '23 years old',
        'Male', '22, Station Road, Moradabad, Uttar Pradesh - 244001',
        919264000000.0, 'Recycling and Waste Management', 'Geologist',
        'INR 2,000.00', 'Member'],
       ['Aaryav Sharma', 'aaryav.sharma26@gmail.com', '31 years old',
        'Female', '31, Ram Bagh, Agra, Uttar Pradesh - 282005',
        918195000000.0, 'Humanitarian Assistance in Conflict Zones',
        'Meditation Instructor', 'INR 16,789.00', 'Member'],
       ['Anshika Verma', 'anshika.verma51@yahoo.com', '29 years old',
        'Male', '58, Nirala Nagar, Meerut, Uttar Pradesh - 250001',
        919429000000.0, 'Home Repair and Renovation',
        'Refugee Resettlement Specialist', 'INR 3,000.00', 'Member'],
       ['Ehan Joshi', 'ehan.joshi73@gmail.com', '28 years old', 'Female',
        '27, Rajendra Nagar, Varanasi, Uttar Pradesh - 221002',
        918765000000.0, 'Support for Victims of Domestic Violence',
        'Construction Worker', 'INR 8,000.00', 'Member'],
       ['Kaira Kapoor', 'kaira.kapoor14@yahoo.com', '27 years old',
        'Male', '43, Connaught Place, Allahabad, Uttar Pradesh - 211002',
        919852000000.0, 'Youth Leadership Development', 'Birdwatcher',
        'INR 5,432.00', 'Member'],
       ['Aaradhya Patel', 'aaradhya.patel19@gmail.com', '25 years old',
        'Female',
        '54, Jawaharlal Road, Gorakhpur, Uttar Pradesh - 273001',
        918219000000.0, 'Environmental Cleanup Campaign',
        'Marriage Counselor', 'INR 5,432.00', 'Member'],
       ['Vivaan Mehta', 'vivaan.mehta39@yahoo.com', '30 years old',
        'Male', '26, Sardar Patel Marg, Kanpur, Uttar Pradesh - 208003',
        919487000000.0, 'Medical Camps in Underserved Areas',
        'Wildlife Biologist', 'INR 11,234.00', 'Member'],
       ['Aarushi Khanna', 'aarushi.khanna62@gmail.com', '26 years old',
        'Female', '67, Civil Lines, Lucknow, Uttar Pradesh - 226005',
        918397000000.0, 'Solar Energy Access Program',
        'Vocational Counselor', 'INR 1,000.00', 'Member'],
       ['Vihan Chauhan', 'vihan.chauhan49@yahoo.com', '23 years old',
        'Male', '45, M.G. Road, Meerut, Uttar Pradesh - 250003',
        919672000000.0, 'Nutritional Gardens for Schools', 'Tax Advisor',
        'INR 18,765.00', 'Member'],
       ['Anya Sharma', 'anya.sharma87@gmail.com', '29 years old',
        'Female', '38, Chowk Bazaar, Varanasi, Uttar Pradesh - 221002',
        918927000000.0, 'Educational Scholarships for Girls',
        'Environmental Scientist', 'INR 1,234.00', 'Member'],
       ['Yuvan Kapoor', 'yuvan.kapoor24@yahoo.com', '27 years old',
        'Male', '73, Civil Lines, Agra, Uttar Pradesh - 282007',
        918493000000.0, 'Disaster Response Training', 'Fashion Designer',
        'INR 5,432.00', 'Member'],
       ['Tia Joshi', 'tia.joshi12@gmail.com', '25 years old', 'Female',
        '48, Mahaveer Road, Kanpur, Uttar Pradesh - 208005',
        919365000000.0, 'Access to Clean Cooking Technologies',
        'Crisis Hotline Operator', 'INR 8,765.00', 'Member'],
       ['Ahaan Mehta', 'ahaan.mehta29@yahoo.com', '22 years old', 'Male',
        '20, Alambagh, Allahabad, Uttar Pradesh - 211002',
        918942000000.0, 'Humanitarian Aid for Refugees',
        'Nutrition Coach', 'INR 1,234.00', 'Member'],
       ['Aditi Gupta', 'aditi.gupta28@gmail.com', '23 years old',
        'Female', '55, Ashok Nagar, Lucknow, Uttar Pradesh - 226007',
        919272000000.0, 'Child Rights Advocacy',
        'Archaeological Surveyor', 'INR 14,567.00', 'Member'],
       ['Ayana Verma', 'ayana.verma84@yahoo.com', '24 years old',
        'Female', '29, Kailashpuri, Gorakhpur, Uttar Pradesh - 273001',
        919854000000.0, 'Community Radio Station', 'Adoption Counselor',
        'INR 1,000.00', 'Member'],
       ['Rishabh Sharma', 'rishabh.sharma52@gmail.com', '28 years old',
        'Male', '77, Nishatganj, Kanpur, Uttar Pradesh - 208007',
        918197000000.0, 'Youth Arts and Music Workshops',

In [40]:
# .T gives transpose(rows become columns and columns become rows) as in case of matrix
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
first,Harsh,0.447141,0.03562,0.164911,0.562418,0.326161,0.276821,0.399896,0.046161,0.810729,...,0.906644,0.57455,0.796708,0.139266,0.162873,0.392649,0.645468,0.493697,0.190003,0.798825
second,0.588614,0.361976,0.970457,0.754886,0.465644,0.583847,0.549231,0.73931,0.902992,0.953883,...,0.69722,0.098,0.932129,0.366045,0.770412,0.669148,0.576503,0.939379,0.969741,0.226248
third,0.90214,0.715184,0.223923,0.834634,0.282881,0.745307,0.340078,0.275218,0.612128,0.639422,...,0.56647,0.266659,0.048613,0.59197,0.598798,0.459183,0.044908,0.626982,0.640036,0.534147
fourth,0.849591,0.452131,0.300513,0.272449,0.937006,0.646186,0.39958,0.169836,0.667644,0.455222,...,0.046547,0.665027,0.058112,0.794599,0.486326,0.424997,0.712336,0.723298,0.342506,0.255755
fifth,0.771212,0.208883,0.453816,0.620027,0.993652,0.91821,0.341078,0.419883,0.269211,0.537328,...,0.276965,0.028632,0.672102,0.208305,0.301891,0.45645,0.263066,0.78859,0.35373,0.099024

In [41]:
newdf

        first    second     third    fourth     fifth
0       Harsh  0.588614  0.902140  0.849591  0.771212
1    0.447141  0.361976  0.715184  0.452131  0.208883
2     0.03562  0.970457  0.223923  0.300513  0.453816
3    0.164911  0.754886  0.834634  0.272449  0.620027
4    0.562418  0.465644  0.282881  0.937006  0.993652
..        ...       ...       ...       ...       ...
329  0.392649  0.669148  0.459183  0.424997  0.456450
330  0.645468  0.576503  0.044908  0.712336  0.263066
331  0.493697  0.939379  0.626982  0.723298  0.788590
332  0.190003  0.969741  0.640036  0.342506  0.353730
333  0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

In [42]:
# AXIS 0 MEANS ROWS AND AXIS 1 COLUMNS

In [43]:
# sort
newdf.sort_index(axis=0, ascending=False)

        first    second     third    fourth     fifth
333  0.798825  0.226248  0.534147  0.255755  0.099024
332  0.190003  0.969741  0.640036  0.342506  0.353730
331  0.493697  0.939379  0.626982  0.723298  0.788590
330  0.645468  0.576503  0.044908  0.712336  0.263066
329  0.392649  0.669148  0.459183  0.424997  0.456450
..        ...       ...       ...       ...       ...
4    0.562418  0.465644  0.282881  0.937006  0.993652
3    0.164911  0.754886  0.834634  0.272449  0.620027
2     0.03562  0.970457  0.223923  0.300513  0.453816
1    0.447141  0.361976  0.715184  0.452131  0.208883
0       Harsh  0.588614  0.902140  0.849591  0.771212

[334 rows x 5 columns]

In [44]:
# Every Specific Column of a dataframe is a series
type(newdf['first'])

pandas.core.series.Series

In [45]:
# here newdf 2 us just pointing to newdf, it does not have its own memory
newdf2 = newdf

In [46]:
newdf2['first'][0] = 'test content'

C:\Users\HARSH\AppData\Local\Temp\ipykernel_14048\1824018413.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2['first'][0] = 'test content'

In [47]:
# In pandas DataFrames, the standard convention is to access 
# data using column labels first and then specify the row index. 
# This is consistent with the way data is typically organized in tabular 
# form, where you have columns representing variables and rows representing observations.

In [48]:
# here value of newdf is also changing
newdf

            first    second     third    fourth     fifth
0    test content  0.588614  0.902140  0.849591  0.771212
1        0.447141  0.361976  0.715184  0.452131  0.208883
2         0.03562  0.970457  0.223923  0.300513  0.453816
3        0.164911  0.754886  0.834634  0.272449  0.620027
4        0.562418  0.465644  0.282881  0.937006  0.993652
..            ...       ...       ...       ...       ...
329      0.392649  0.669148  0.459183  0.424997  0.456450
330      0.645468  0.576503  0.044908  0.712336  0.263066
331      0.493697  0.939379  0.626982  0.723298  0.788590
332      0.190003  0.969741  0.640036  0.342506  0.353730
333      0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

In [49]:
# To prevent this we should use .copy() method
newdf3 = newdf.copy()

In [50]:
newdf3['first'][0] = 'no effect'

C:\Users\HARSH\AppData\Local\Temp\ipykernel_14048\2201864789.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3['first'][0] = 'no effect'

In [51]:
newdf3.head(2)

       first    second     third    fourth     fifth
0  no effect  0.588614  0.902140  0.849591  0.771212
1   0.447141  0.361976  0.715184  0.452131  0.208883

In [52]:
newdf.head(2)

          first    second     third    fourth     fifth
0  test content  0.588614  0.902140  0.849591  0.771212
1      0.447141  0.361976  0.715184  0.452131  0.208883

In [53]:
# To prevent the warning , we get while changing the values of a DataFrame, as in line 70, we will use loc() method

# here it will be row, col
newdf3.loc[0, 'first'] = "no warning"

In [54]:
newdf3.head(2)

        first    second     third    fourth     fifth
0  no warning  0.588614  0.902140  0.849591  0.771212
1    0.447141  0.361976  0.715184  0.452131  0.208883

In [55]:
# we can also change columns using lists
newdf3.columns = list('ABCDE')

In [57]:
newdf3

              A         B         C         D         E
0    no warning  0.588614  0.902140  0.849591  0.771212
1      0.447141  0.361976  0.715184  0.452131  0.208883
2       0.03562  0.970457  0.223923  0.300513  0.453816
3      0.164911  0.754886  0.834634  0.272449  0.620027
4      0.562418  0.465644  0.282881  0.937006  0.993652
..          ...       ...       ...       ...       ...
329    0.392649  0.669148  0.459183  0.424997  0.456450
330    0.645468  0.576503  0.044908  0.712336  0.263066
331    0.493697  0.939379  0.626982  0.723298  0.788590
332    0.190003  0.969741  0.640036  0.342506  0.353730
333    0.798825  0.226248  0.534147  0.255755  0.099024

[334 rows x 5 columns]

In [59]:
# if we want to delete a column or a row, we can use drop() method
newdf3.drop('E')

KeyError: "['E'] not found in axis"

In [61]:
# it is throwing an error because 'E' cannot be found in axis=0, i.e rows, so we also need to specify the axis
newdf3.drop('E', axis=1)

              A         B         C         D
0    no warning  0.588614  0.902140  0.849591
1      0.447141  0.361976  0.715184  0.452131
2       0.03562  0.970457  0.223923  0.300513
3      0.164911  0.754886  0.834634  0.272449
4      0.562418  0.465644  0.282881  0.937006
..          ...       ...       ...       ...
329    0.392649  0.669148  0.459183  0.424997
330    0.645468  0.576503  0.044908  0.712336
331    0.493697  0.939379  0.626982  0.723298
332    0.190003  0.969741  0.640036  0.342506
333    0.798825  0.226248  0.534147  0.255755

[334 rows x 4 columns]

In [72]:
# to get specific rows and colums
print(newdf3.loc[[1, 2], ['C', 'D']])

print('-------get all rows-------')
print(newdf3.loc[:, ['C', 'D']])

print('-------get all columns-------')
print(newdf3.loc[[1, 2], :])

          C         D
1  0.715184  0.452131
2  0.223923  0.300513
-------get all rows-------
            C         D
0    0.902140  0.849591
1    0.715184  0.452131
2    0.223923  0.300513
3    0.834634  0.272449
4    0.282881  0.937006
..        ...       ...
329  0.459183  0.424997
330  0.044908  0.712336
331  0.626982  0.723298
332  0.640036  0.342506
333  0.534147  0.255755

[334 rows x 2 columns]
-------get all columns-------
          A         B         C         D         E
1  0.447141  0.361976  0.715184  0.452131  0.208883
2   0.03562  0.970457  0.223923  0.300513  0.453816

In [76]:
newdf3.drop(0, axis=0)

            A         B         C         D         E
1    0.447141  0.361976  0.715184  0.452131  0.208883
2     0.03562  0.970457  0.223923  0.300513  0.453816
3    0.164911  0.754886  0.834634  0.272449  0.620027
4    0.562418  0.465644  0.282881  0.937006  0.993652
5    0.326161  0.583847  0.745307  0.646186  0.918210
..        ...       ...       ...       ...       ...
329  0.392649  0.669148  0.459183  0.424997  0.456450
330  0.645468  0.576503  0.044908  0.712336  0.263066
331  0.493697  0.939379  0.626982  0.723298  0.788590
332  0.190003  0.969741  0.640036  0.342506  0.353730
333  0.798825  0.226248  0.534147  0.255755  0.099024

[333 rows x 5 columns]

In [83]:
# Querying a condition
newdf3.loc[(newdf3['B'] < 0.4) & (newdf3['C'] > 0.1)]

            A         B         C         D         E
1    0.447141  0.361976  0.715184  0.452131  0.208883
16    0.90052  0.160475  0.381259  0.838547  0.158735
21   0.639692  0.177570  0.662010  0.561530  0.766055
23    0.79431  0.138985  0.916360  0.070655  0.625221
29   0.616595  0.367976  0.927746  0.631705  0.146042
..        ...       ...       ...       ...       ...
321  0.032672  0.272969  0.398485  0.924194  0.149785
322  0.290808  0.335732  0.464901  0.573900  0.039095
325   0.57455  0.098000  0.266659  0.665027  0.028632
327  0.139266  0.366045  0.591970  0.794599  0.208305
333  0.798825  0.226248  0.534147  0.255755  0.099024

[126 rows x 5 columns]